# Preprocessing

Our Dataframes:

`schedule`
`airlines`
`airports`
`airports2`
`countries`
`planes`
`routes`

In [220]:
import pandas as pd

path = "../data/"

schedule = pd.read_csv(path+"raw/271014744_T_ONTIME_REPORTING.csv")
airlines = pd.read_csv(path+"raw/airlines.dat.txt", header=0, names=["Airline ID", "Name", "Alias", "IATA", "ICAO", "Callsign", "Country", "Active"])
airports = pd.read_csv(path+"raw/airports.dat.txt", header=0, names=["Airport ID", "Name", "City", "Country", "IATA", "ICAO", "Latitude", "Longitude", "Altitude", "Timezone", "DST", "Tz Database", "Type", "Source"])
airports2 = pd.read_csv(path+"raw/airports-extended.dat.txt", header=0, names=["Airport ID", "Name", "City", "Country", "IATA", "ICAO", "Latitude", "Longitude", "Altitude", "Timezone", "DST", "Tz Database", "Type", "Source"])
countries = pd.read_csv(path+"raw/countries.dat.txt", header=0, names=["Name", "ISO Code", "DAFIF Code"])
planes = pd.read_csv(path+"raw/planes.dat.txt", header=0, names=["Name", "IATA Code", "ICAO Code"])
routes = pd.read_csv(path+"raw/routes.dat.txt", header=0, names=["Airline", "Airline ID", "Source Airport", "Source Airport ID", "Destination Airport", "Destination Airport ID", "Codeshare", "Stops", "Equipment"])

In [221]:
schedule.head(2)

,FL_DATE,OP_CARRIER,ORIGIN,DEST,CRS_DEP_TIME,DEP_TIME,CRS_ARR_TIME,ARR_TIME,CANCELLED,CANCELLATION_CODE,DIVERTED,CARRIER_DELAY,WEATHER_DELAY,NAS_DELAY,SECURITY_DELAY,LATE_AIRCRAFT_DELAY,Unnamed: 16
0,2019-01-01,9E,MSP,MKE,1122,1155.0,1251,1259.0,0.0,NaN,0.0,NaN,NaN,NaN,NaN,NaN,NaN
1,2019-01-01,9E,ATL,PHF,954,1002.0,1137,1132.0,0.0,NaN,0.0,NaN,NaN,NaN,NaN,NaN,NaN

In [222]:
airlines.head(2)

   Airline ID            Name Alias IATA ICAO Callsign        Country Active
0           1  Private flight    \N    -  NaN      NaN            NaN      Y
1           2     135 Airways    \N  NaN  GNL  GENERAL  United States      N

In [223]:
airports.head(2)

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,2,Madang Airport,Madang,Papua New Guinea,MAG,AYMD,-5.20708,145.789001,20,10,U,Pacific/Port_Moresby,airport,OurAirports
1,3,Mount Hagen Kagamuga Airport,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.82679,144.296005,5388,10,U,Pacific/Port_Moresby,airport,OurAirports

In [224]:
airports2.head(2)

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,2,Madang Airport,Madang,Papua New Guinea,MAG,AYMD,-5.20708,145.789001,20,10,U,Pacific/Port_Moresby,airport,OurAirports
1,3,Mount Hagen Kagamuga Airport,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.82679,144.296005,5388,10,U,Pacific/Port_Moresby,airport,OurAirports

In [225]:
countries.head(2)

                  Name ISO Code DAFIF Code
0                Aruba       AW         AA
1  Antigua and Barbuda       AG         AC

In [226]:
planes.head(2)

                                           Name IATA Code ICAO Code
0  Aerospatiale (Sud Aviation) Se.210 Caravelle       CRV      S210
1                  Aerospatiale SN.601 Corvette       NDC      S601

In [227]:
routes.head(2)

,Airline,Airline ID,Source Airport,Source Airport ID,Destination Airport,Destination Airport ID,Codeshare,Stops,Equipment
0,2B,410,ASF,2966,KZN,2990,NaN,0,CR2
1,2B,410,ASF,2966,MRV,2962,NaN,0,CR2

In [228]:
print(schedule.shape)
print(airlines.shape)
print(airports.shape)
print(airports2.shape)
print(countries.shape)
print(planes.shape)
print(routes.shape)

(583985, 17)
(6161, 8)
(7697, 14)
(12667, 14)
(260, 3)
(245, 3)
(67662, 9)

# Data Cleaning
Null Values<br>
Duplicate Values<br>
Check Data Types

## Null Values

In [229]:
print(schedule.isna().sum().sum())
print(airlines.isna().sum().sum())
print(airports.isna().sum().sum())
print(airports2.isna().sum().sum())
print(countries.isna().sum().sum())
print(planes.isna().sum().sum())
print(routes.isna().sum().sum())

3578472
6042
49
50
1
0
53083

In [230]:
def get_missing(df):
    return (pd.DataFrame(df.isna().sum()) / df.shape[0]) * 100

def print_df(df, items):
    df_new = pd.DataFrame(df.iloc[0:items]).reset_index()
    for i in range(items, df.shape[0], items):
        df_new = pd.concat([df_new, pd.DataFrame(df.iloc[i:i + items]).reset_index()], axis=1)
    return df_new

In [231]:
print_df(get_missing(schedule), 3)

,index,0,index,0,index,0,index,0,index,0,index,0
0,FL_DATE,0.0,DEST,0.000000,CRS_ARR_TIME,0.000000,CANCELLATION_CODE,97.135885,WEATHER_DELAY,81.982071,LATE_AIRCRAFT_DELAY,81.982071
1,OP_CARRIER,0.0,CRS_DEP_TIME,0.000000,ARR_TIME,2.921479,DIVERTED,0.000000,NAS_DELAY,81.982071,Unnamed: 16,100.000000
2,ORIGIN,0.0,DEP_TIME,2.800072,CANCELLED,0.000000,CARRIER_DELAY,81.982071,SECURITY_DELAY,81.982071,NaN,NaN

In [232]:
get_missing(airlines).T

,Airline ID,Name,Alias,IATA,ICAO,Callsign,Country,Active
0,0.0,0.0,8.212952,75.101445,1.395877,13.114754,0.243467,0.0

In [233]:
get_missing(airports).T

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,0.0,0.0,0.636612,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [234]:
get_missing(airports2).T

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,0.0,0.0,0.386832,0.0,0.0,0.007895,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [235]:
get_missing(countries).T

   Name  ISO Code  DAFIF Code
0   0.0  0.384615         0.0

In [236]:
get_missing(planes).T

   Name  IATA Code  ICAO Code
0   0.0        0.0        0.0

In [237]:
get_missing(routes).T

,Airline,Airline ID,Source Airport,Source Airport ID,Destination Airport,Destination Airport ID,Codeshare,Stops,Equipment
0,0.0,0.0,0.0,0.0,0.0,0.0,78.426591,0.0,0.026603

### Null Values Solution
Drop Columns with more than 20% missing data<br>
Drop Rows with missing data

In [238]:
schedule.dropna(subset=["DEP_TIME", "ARR_TIME"], inplace=True)
schedule.drop(["CANCELLATION_CODE", "CARRIER_DELAY", "WEATHER_DELAY", "NAS_DELAY", "SECURITY_DELAY", "LATE_AIRCRAFT_DELAY", "Unnamed: 16"], axis=1, inplace=True)
get_missing(schedule).T

,FL_DATE,OP_CARRIER,ORIGIN,DEST,CRS_DEP_TIME,DEP_TIME,CRS_ARR_TIME,ARR_TIME,CANCELLED,DIVERTED
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [239]:
airlines.dropna(subset=["Alias", "ICAO", "Callsign", "Country"], inplace=True)
airlines.drop(["IATA"], axis=1, inplace=True)
get_missing(airlines).T

   Airline ID  Name  Alias  ICAO  Callsign  Country  Active
0         0.0   0.0    0.0   0.0       0.0      0.0     0.0

In [240]:
airports.dropna(subset=["City"], inplace=True)
get_missing(airports).T

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [241]:
airports2.dropna(subset=["City", "ICAO"], inplace=True)
get_missing(airports2).T

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [242]:
countries.dropna(subset=["ISO Code"], inplace=True)
get_missing(countries).T

   Name  ISO Code  DAFIF Code
0   0.0       0.0         0.0

In [243]:
routes.dropna(subset=["Equipment"], inplace=True)
routes.drop(["Codeshare"], axis=1, inplace=True)
get_missing(routes).T

,Airline,Airline ID,Source Airport,Source Airport ID,Destination Airport,Destination Airport ID,Stops,Equipment
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

## Duplicate Values

In [244]:
schedule.duplicated(keep=False).sum()

np.int64(0)

In [245]:
airlines.duplicated(keep=False).sum()

np.int64(0)

In [246]:
airports.duplicated(keep=False).sum()

np.int64(0)

In [247]:
airports2.duplicated(keep=False).sum()

np.int64(0)

In [248]:
countries.duplicated(keep=False).sum()

np.int64(0)

In [249]:
planes.duplicated(keep=False).sum()

np.int64(0)

In [250]:
routes.duplicated(keep=False).sum()

np.int64(0)

## Check Data Types

In [251]:
dfs = [schedule, airlines, airports, airports2, countries, planes, routes]
dfs_comb = pd.DataFrame()

for df in dfs:
    dfs_comb = pd.concat([dfs_comb, pd.DataFrame(df.dtypes).reset_index()], axis=1)

dfs_comb

,index,0,index,0,index,0,index,0,index,0,index,0,index,0
0,FL_DATE,object,Airline ID,int64,Airport ID,int64,Airport ID,int64,Name,object,Name,object,Airline,object
1,OP_CARRIER,object,Name,object,Name,object,Name,object,ISO Code,object,IATA Code,object,Airline ID,object
2,ORIGIN,object,Alias,object,City,object,City,object,DAFIF Code,object,ICAO Code,object,Source Airport,object
3,DEST,object,ICAO,object,Country,object,Country,object,NaN,NaN,NaN,NaN,Source Airport ID,object
4,CRS_DEP_TIME,int64,Callsign,object,IATA,object,IATA,object,NaN,NaN,NaN,NaN,Destination Airport,object
5,DEP_TIME,float64,Country,object,ICAO,object,ICAO,object,NaN,NaN,NaN,NaN,Destination Airport ID,object
6,CRS_ARR_TIME,int64,Active,object,Latitude,float64,Latitude,float64,NaN,NaN,NaN,NaN,Stops,int64
7,ARR_TIME,float64,NaN,NaN,Longitude,float64,Longitude,float64,NaN,NaN,NaN,NaN,Equipment,object
8,CANCELLED,float64,NaN,NaN,Altitude,int64,Altitude,int64,NaN,NaN,NaN,NaN,NaN,NaN
9,DIVERTED,float64,NaN,NaN,Timezone,object,Timezone,object,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,DST,object,DST,object,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,Tz Database,object,Tz Database,object,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,Type,object,Type,object,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,Source,object,Source,object,NaN,NaN,NaN,NaN,NaN,NaN

## Data Types Solution

In [252]:
schedule["CRS_DEP_TIME"] = schedule["CRS_DEP_TIME"].astype("float64")
schedule["CRS_ARR_TIME"] = schedule["CRS_ARR_TIME"].astype("float64")
# airports["Timezone"] = airports["Timezone"].astype("float64")
# airports2["Timezone"] = airports2["Timezone"].astype("float64")

# Data Tansformation
Incorrect Values<br>
Normalize Numerical Values<br>
Intersection of `airports` and `airports2`

## Incorrect Values

In [253]:
def get_term(df, term):
    return (pd.DataFrame((df == term).sum()) / df.shape[0]) * 100

In [254]:
print(schedule["CANCELLED"].unique())
print(schedule["DIVERTED"].value_counts())

[0.]
DIVERTED
0.0    565963
1.0       961
Name: count, dtype: int64

In [255]:
get_term(airlines, "\\N").T

   Airline ID  Name      Alias      ICAO  Callsign   Country  Active
0         0.0   0.0  97.839206  0.136266  0.038933  0.038933     0.0

In [256]:
print(airlines["Active"].value_counts())

Active
N    4386
Y     750
n       1
Name: count, dtype: int64

In [257]:
get_term(airports, "\\N").T

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,0.0,0.0,0.0,0.0,21.129707,0.013075,0.0,0.0,0.0,3.974895,3.974895,12.709205,0.0,0.0

In [258]:
print(airports["Latitude"].min())
print(airports["Latitude"].max())
print(airports["Longitude"].min())
print(airports["Longitude"].max())
print(airports["Altitude"].min())
print(airports["Altitude"].max())

-90.0
89.5
-179.876998901
179.951004028
-1266
14472

In [259]:
print(airports["Type"].unique())
print(airports["Source"].unique())

['airport']
['OurAirports']

In [260]:
get_term(airports2, "\\N").T

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,0.0,0.0,0.0,0.0,45.44662,35.721645,0.0,0.0,0.0,2.409448,2.409448,33.549972,13.08552,13.08552

In [261]:
print(airports2["Latitude"].min())
print(airports2["Latitude"].max())
print(airports2["Longitude"].min())
print(airports2["Longitude"].max())
print(airports2["Altitude"].min())
print(airports2["Altitude"].max())

-90.0
90.0
-179.876998901
179.951004028
-1266
14472

In [262]:
print(airports2["Type"].unique())
print(airports2["Source"].unique())

['airport' 'unknown' 'station' 'port' '\\N']
['OurAirports' 'Legacy' 'User' '\\N']

In [263]:
get_term(countries, "\\N").T

   Name  ISO Code  DAFIF Code
0   0.0  7.335907         0.0

In [264]:
get_term(planes, "\\N").T

   Name  IATA Code  ICAO Code
0   0.0   4.897959   5.714286

In [265]:
get_term(routes, "\\N").T

,Airline,Airline ID,Source Airport,Source Airport ID,Destination Airport,Destination Airport ID,Stops,Equipment
0,0.0,0.705162,0.0,0.325232,0.0,0.32671,0.0,0.0

In [266]:
routes["Stops"].value_counts()

Stops
0    67633
1       11
Name: count, dtype: int64

## Incorrect Values Solution
Columns with more than 20% missing data, just write "NA" as need the data in other columns for same rows<br>
Drop Rows with missing data

In [267]:
airlines = airlines[airlines["ICAO"] != "\\N"]
airlines = airlines[airlines["Callsign"] != "\\N"]
airlines = airlines[airlines["Country"] != "\\N"]
airlines.drop(["Alias"], axis=1, inplace=True)
get_term(airlines, "\\N").T

   Airline ID  Name  ICAO  Callsign  Country  Active
0         0.0   0.0   0.0       0.0      0.0     0.0

In [268]:
airports = airports[airports["ICAO"] != "\\N"]
airports = airports[airports["Timezone"] != "\\N"]
airports = airports[airports["DST"] != "\\N"]
airports = airports[airports["Tz Database"] != "\\N"]
airports.replace("\\N", "NA", inplace=True)
get_term(airports, "\\N").T

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [269]:
airports2 = airports2[airports2["Timezone"] != "\\N"]
airports2 = airports2[airports2["DST"] != "\\N"]
airports2.replace("\\N", "NA", inplace=True)
airports2.replace("unknown", "NA", inplace=True)
get_term(airports2, "\\N").T

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [270]:
countries = countries[countries["ISO Code"] != "\\N"]
get_term(countries, "\\N").T

   Name  ISO Code  DAFIF Code
0   0.0       0.0         0.0

In [271]:
planes = planes[planes["IATA Code"] != "\\N"]
planes = planes[planes["ICAO Code"] != "\\N"]
get_term(planes, "\\N").T

   Name  IATA Code  ICAO Code
0   0.0        0.0        0.0

In [272]:
routes = routes[routes["Airline ID"] != "\\N"]
routes = routes[routes["Source Airport ID"] != "\\N"]
routes = routes[routes[ "Destination Airport ID"] != "\\N"]
get_term(routes, "\\N").T

,Airline,Airline ID,Source Airport,Source Airport ID,Destination Airport,Destination Airport ID,Stops,Equipment
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

## Normalize Numerical Values

In [273]:
schedule["N_CRS_DEP_TIME"] = schedule["CRS_DEP_TIME"] / schedule["CRS_DEP_TIME"].max()
schedule["N_DEP_TIME"] = schedule["DEP_TIME"] / schedule["DEP_TIME"].max()
schedule["N_CRS_ARR_TIME"] = schedule["CRS_ARR_TIME"] / schedule["CRS_ARR_TIME"].max()
schedule["N_ARR_TIME"] = schedule["ARR_TIME"] / schedule["ARR_TIME"].max()

In [274]:
airports["Timezone"] = airports["Timezone"].astype("float64")
airports2["Timezone"] = airports2["Timezone"].astype("float64")

In [275]:
airports["N_Latitude"] = airports["Latitude"] / airports["Latitude"].max()
airports["N_Longitude"] = airports["Longitude"] / airports["Longitude"].max()
airports["N_Altitude"] = airports["Altitude"] / airports["Altitude"].max()
airports["N_Timezone"] = airports["Timezone"] / airports["Timezone"].max()

airports2["N_Latitude"] = airports2["Latitude"] / airports2["Latitude"].max()
airports2["N_Longitude"] = airports2["Longitude"] / airports2["Longitude"].max()
airports2["N_Altitude"] = airports2["Altitude"] / airports2["Altitude"].max()
airports2["N_Timezone"] = airports2["Timezone"] / airports2["Timezone"].max()

In [276]:
routes["Stops"].unique()

array([0, 1])

## Intersection of `airports` and `airports2`

In [277]:
print(airports.columns == airports2.columns)

airports_comb = pd.concat([airports, airports2], axis=0)
airports_comb.duplicated(subset="Airport ID", keep=False).sum() / airports_comb.shape[0]

[ True  True  True  True  True  True  True  True  True  True  True  True
  True  True  True  True  True  True]

np.float64(0.7030756267116073)

In [278]:
airports_comb[airports_comb.duplicated(subset="Airport ID", keep=False)].sort_values("Airport ID").head(2)

,Airport ID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz Database,Type,Source,N_Latitude,N_Longitude,N_Altitude,N_Timezone
0,2,Madang Airport,Madang,Papua New Guinea,MAG,AYMD,-5.20708,145.789001,20,10.0,U,Pacific/Port_Moresby,airport,OurAirports,-0.057856,0.810159,0.001382,0.740741
0,2,Madang Airport,Madang,Papua New Guinea,MAG,AYMD,-5.20708,145.789001,20,10.0,U,Pacific/Port_Moresby,airport,OurAirports,-0.063103,0.810159,0.001382,0.769231

In [279]:
airports_comb.drop_duplicates(subset=["Airport ID"], inplace=True)
airports_comb.duplicated(subset="Airport ID", keep=False).sum() / airports_comb.shape[0]

np.float64(0.0)

# Export

In [280]:
schedule.to_csv(path+"/processed/schedule.csv", index=False)
airlines.to_csv(path+"/processed/airlines.csv", index=False)
airports_comb.to_csv(path+"/processed/airports.csv", index=False)
countries.to_csv(path+"/processed/countries.csv", index=False)
planes.to_csv(path+"/processed/planes.csv", index=False)
routes.to_csv(path+"/processed/routes.csv", index=False)

Notes:<br>
1. `schedule` df has `CANCELLED` column which has only 0. values<br>
2. `schedule` df has `DIVERTED` column, with heavy imbalance (schedule being diverted is obviously a rare occasion)<br>
3. `airlines` df has `Active` column, with heavy imbalance (seems airlines is a stable business)<br>
4. `airports` df has `Type` which has only 1 unique value<br>
5. `airports` df has `Source` which has only 1 unique value<br>
6. `routes` df has `Stops` column, with heavy imbalance